# Домашнее задание Семинар 1

#---------------------------------------------------------------------------------
# Задача 2
#---------------------------------------------------------------------------------
# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# print("Introduce 3 digit number: ")
# a = int(input())
# sum = 0
# if 99 < a < 1000:
#     while a > 0:
#         sum = sum + a%10
#         a = a // 10
#     print (sum)
# else:
#     print("You introduced not a 3-digit number.\nTry again!")
    
#---------------------------------------------------------------------------------
# Задача 4
#---------------------------------------------------------------------------------
# Петя, Катя и Сережа делают из бумаги журавликов.
# Вместе они сделали S журавликов.Сколько журавликов сделал
# каждый ребенок, если известно, что Петя и Сережа сделали
# одинаковое количество журавликов, а Катя сделала в два раза
# больше журавликов, чем Петя и Сережа вместе?
# Пример:
# 6 -> 1 4 1
# 24 -> 4 16 4
# 60 -> 10 40 10

# print('Introduce a number of paper cranes: ')
# s = int(input())

# kate_n = s* 2/3 # если 3/3 - это все количество журавликов, то Катя сделала 2/3 журавликов
# rest = kate_n/2
# sergey_n = rest/2
# petr_n = sergey_n
# if s%3 == 0 and kate_n > sergey_n and petr_n%1 == 0:
#     print(f'Kate made: {kate_n}, Petr made: {petr_n}, Sergey made: {sergey_n}')
# else:
#     print('In given conditions, s you introduced cannot be true')




#---------------------------------------------------------------------------------
# Задача 6
#---------------------------------------------------------------------------------
# Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались
# за проезд и получали билет с номером. Счастливым билетом называют
# такой билет с шестизначным номером, где сумма первых трех цифр
# равна сумме последних трех. Т.е. билет с номером 385916 – счастливый,
# т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.
# Пример:
# 385916 -> yes
# 123456 -> no

# print("Introduce a 6-digit number: ")
# a = int (input())
# a1 = a
# sum1 = 0
# while a1 > 1000:
#     sum1 = sum1 + a1%10
#     a1 = a1//10

# a2 = a1
# sum2 = 0
# while a2 > 0:
#     sum2 = sum2 + a2%10
#     a2 = a2//10
# print(sum2)
# print(sum1)

# if sum1==sum2:
#     print('Lucky ticket!')
# else:
#     print('Bad luck! Try again!')


#---------------------------------------------------------------------------------
# Задача 8
#---------------------------------------------------------------------------------
# Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
# если разрешается сделать один разлом по прямой между дольками
# (то есть разломить шоколадку на два прямоугольника).
# Пример:
# 3 2 4 -> yes
# 3 2 1 -> no

# n = int(input())
# m = int(input())
# k = int(input())

# if (((n * m) - m) >= k or ((n * m) - n) >= k) and ((k%m == 0) or (k%n == 0)):
#     print (f'Можно отломить {k} долек(дольки) зараз.')
# else:
#     print (f'НЕЛЬЗЯ отломить {k} долек(дольки) зараз.')